JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/*
 * USART 2->STLINK
 *
 * TX->PA2
 * RX->PA3
 *
 */

#include <string.h>
#include "stm32f446xx.h"

char variables_key[] = {'V','F','H'};
uint32_t variables_value[3];

char data1[] = "Test data\n";
char receive_data[1000];

uint32_t getValue_Variable(char s)
{
	int x;
	for(x = 0; variables_key[x] != s; x++);
	return variables_value[x];
}

void addValue_Variable(char s, uint32_t value)
{
	int x;
	for(x = 0; variables_key[x] != s; x++);
	variables_value[x] = value;
}

uint8_t rxCmplt = RESET;

USART_Handle_t USART2Handle;

USART_Handle_t USART2Handle;

void USART2_GPIOInits(void)
{
	GPIO_Handle_t USART2pin;
	USART2pin.pGPIOx = GPIOA;
	USART2pin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	USART2pin.GPIO_PinConfig.GPIO_PinAltFunMode = 7;
	USART2pin.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	USART2pin.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	USART2pin.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	//TX
	USART2pin.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_2;
	GPIO_Init(&USART2pin);
	//RX
	USART2pin.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_3;
	GPIO_Init(&USART2pin);
}

void USART2_Inits(USART_Handle_t *pUSART2Handle)
{
	pUSART2Handle->pUSARTx = USART2;
	pUSART2Handle->USARTConfig.USART_Baud = USART_STD_BAUD_115200;
	pUSART2Handle->USARTConfig.USART_HWFlowControl = USART_HW_FC_NONE;
	pUSART2Handle->USARTConfig.USART_Mode = USART_MODE_TX_RX;
	pUSART2Handle->USARTConfig.USART_NoOfStopBits = USART_1_STOPBITS;
	pUSART2Handle->USARTConfig.USART_ParityControl = USART_PARITY_DISABLE;
	pUSART2Handle->USARTConfig.USART_WordLength = USART_WLEN_8BITS;

	USART_Init(pUSART2Handle);
}

int main(void)
{
	SystemCLK_Config_84MHz();

	SCB_CPACR |= ((3UL << 10*2) | (3UL << 11*2)); //FPU Enabled

    USART2_GPIOInits();
	USART2_Inits(&USART2Handle);
	USART_PeripheralControl(USART2Handle.pUSARTx, ENABLE);

	USART_IRQInterruptConfig(IRQ_NO_USART2,ENABLE);
	USART_IRQPriorityConfig(IRQ_NO_USART2,NVIC_IRQ_PRI15);

	memset(receive_data, 0, sizeof(receive_data));
	while(USART_ReceiveDataUntilWithIT(&USART2Handle,(uint8_t *)receive_data, (uint8_t)'\n') != USART_READY);

	while(1);
	return 0;
}

void USART2_IRQHandler(void)
{
	USART_IRQHandling(&USART2Handle);
}

void USART_DecodeRX(USART_Handle_t *pUSARTHandle)
{
	uint8_t message[7];
	uint32_t value;
	char variable;
	pUSARTHandle->pRxBuffer -= pUSARTHandle->RxLen;
	uint8_t w_r;
	if(*pUSARTHandle->pRxBuffer == '$')
	{
		w_r = ENABLE;
	}else if(*pUSARTHandle->pRxBuffer == '%')
	{
		w_r = DISABLE;
	}
	pUSARTHandle->pRxBuffer++;
	variable = *pUSARTHandle->pRxBuffer;
	value = getValue_Variable(variable);
	pUSARTHandle->pRxBuffer++;
	if(w_r)
	{
		value = *(pUSARTHandle->pRxBuffer++);
		value += *(pUSARTHandle->pRxBuffer++)<<8;
		value += *(pUSARTHandle->pRxBuffer++)<<16;
		value += *(pUSARTHandle->pRxBuffer++)<<24;
		addValue_Variable(variable, value);
	}else
	{
		value = getValue_Variable(variable);
		message[0] = (uint64_t)'$';
		message[1] = variable;
		message[2] = (value & 0xFF);
		message[3] = ((value >> 8)& 0xFF);
		message[4] = ((value >> 16)& 0xFF);
		message[5] = ((value >> 24)& 0xFF);
		message[6] = (uint64_t)'\n';

		USART_SendDataWithIT(&USART2Handle,(uint8_t *)(&message), 7);
	}

	while(USART_ReceiveDataUntilWithIT(&USART2Handle,(uint8_t *)receive_data, (uint8_t)'\n') != USART_READY);
}

void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t ApEv)
{
   if(ApEv == USART_EVENT_RX_CMPLT)
   {
	   USART_DecodeRX(pUSARTHandle);
   }else if (ApEv == USART_EVENT_TX_CMPLT)
   {
	   ;
   }
}
